{
	"id": "173010",
	"key": "TIMOB-26831",
	"fields": {
		"issuetype": {
			"id": "7",
			"description": "gh.issue.story.desc",
			"name": "Story",
			"subtask": false
		},
		"project": {
			"id": "10153",
			"key": "TIMOB",
			"name": "Titanium SDK/CLI",
			"projectCategory": {
				"id": "10100",
				"description": "Titanium and related SDKs used in application development",
				"name": "Client"
			}
		},
		"fixVersions": [],
		"resolution": null,
		"resolutiondate": null,
		"created": "2019-02-16T09:29:47.000+0000",
		"priority": {
			"name": "High",
			"id": "2"
		},
		"labels": [
			"archTriage"
		],
		"versions": [],
		"issuelinks": [],
		"assignee": {
			"name": "amukherjee",
			"key": "amukherjee",
			"displayName": "Abir Mukherjee",
			"active": true,
			"timeZone": "America/Los_Angeles"
		},
		"updated": "2021-02-06T10:01:17.000+0000",
		"status": {
			"description": "The issue is open and ready for the assignee to start work on it.",
			"name": "Open",
			"id": "1",
			"statusCategory": {
				"id": 2,
				"key": "new",
				"colorName": "blue-gray",
				"name": "To Do"
			}
		},
		"components": [
			{
				"id": "10202",
				"name": "Android",
				"description": "Android Platform"
			},
			{
				"id": "10206",
				"name": "iOS",
				"description": "iOS Platform"
			}
		],
		"description": "We use a *lot* modules (~ 40, about half/half iOS/Android) in our project - many of them are maintained by ourselves which is fine. We love the performance of them, but find it nearly impossible to debug them in a proper way.\r\n\r\n*iOS*\r\n\r\nFor iOS, we used to create a demo project that includes a pre-built version of module, open the generated project, drag the app.js to the {{Resources}} group, drag the module project into the Xcode project, link the module product into the main target and add the module project as a build dependency aaaand build. Sounds complicated? It is! Unfortunately, this is not even possible since 7.5.0 because of the new \"ti.main\" file that is not part of the project so it either needs to be copied from the SDK source to the Xcode project or just be renamed in the kroll core to \"app.js\" so it directly accesses the app.js. In SDK 8, this is also not possible anymore, because the TitaniumKit.framework manages the kroll-core, so it's precompiled already and cannot be changed during a generated project (except ripping it out again and re-referencing the project again). Still can follow? Ok, here is the suggestion: Fix the generated project (!). This has been discussed in numerous other tickets, Slack threads and StackOverflow posts. People should be able to just open  the generated project and do whatever they want to with it. Practically, this means that all source files should be linked as resources *or* be copied to the product with a simple build-phase script. This would solve most of our iOS issues regarding developer-experience already.\r\n\r\n*Android*\r\n\r\nFor Android, we still need to trial-and-error every module change, means to change something in the *.java files, compile it, add it to a project, clean the project, do a full build and see what comes out of it. I heard of a way to integrate modules into Android Studio, but there is zero documentation about that. As a developer, I'd love to just open the module directory in Android studio and Android studio would link all necessary libraries to it, so the module runs.\r\n\r\nBonus: The best would be to just pick up the {{example/app.js}} that is available in every module project and link that one to a \"module demo project\". Maybe a new ti command or npm package could be \"ti build -p ios --test-module\" from the module project and it would be smart enough to a) check the directories for ios/android and b) check the example/app.js for an execution point and then just run the project. Something similar (I think) is already done when using \"ti build\" alone, which uses the app.js as well, but it doesn't link anything, so debugging is not possible either.\r\n\r\nSorry for the long text, but I hope I get can something started with this! Maybe it's not too hard to do, as many of the required components are already in place and \"just\" need to be combined. Thx!",
		"attachment": [],
		"flagged": false,
		"summary": "TiAPI: Clarify a way to properly debug native modules",
		"creator": {
			"name": "hknoechel",
			"key": "hansknoechel",
			"displayName": "Hans Knöchel",
			"active": true,
			"timeZone": "Europe/Berlin"
		},
		"subtasks": [],
		"reporter": {
			"name": "hknoechel",
			"key": "hansknoechel",
			"displayName": "Hans Knöchel",
			"active": true,
			"timeZone": "Europe/Berlin"
		},
		"environment": null,
		"comment": {
			"comments": [
				{
					"id": "458169",
					"author": {
						"name": "hknoechel",
						"key": "hansknoechel",
						"displayName": "Hans Knöchel",
						"active": true,
						"timeZone": "Europe/Berlin"
					},
					"body": "Since this ticket did not receive any feedback from Appcelerator, I took a look at it myself. The good thing: I found a way to run generated iOS projects from build/iphone (and even if they're Alloy-based). The bad thing: It will require some CLI changes that Appcelerator may not like. Trying to come up with a PR soon.",
					"updateAuthor": {
						"name": "hknoechel",
						"key": "hansknoechel",
						"displayName": "Hans Knöchel",
						"active": true,
						"timeZone": "Europe/Berlin"
					},
					"created": "2021-02-06T10:00:10.000+0000",
					"updated": "2021-02-06T10:00:10.000+0000"
				}
			],
			"maxResults": 1,
			"total": 1,
			"startAt": 0
		}
	}
}