{
	"id": "172879",
	"key": "TIMOB-26737",
	"fields": {
		"issuetype": {
			"id": "7",
			"description": "gh.issue.story.desc",
			"name": "Story",
			"subtask": false
		},
		"project": {
			"id": "10153",
			"key": "TIMOB",
			"name": "Titanium SDK/CLI",
			"projectCategory": {
				"id": "10100",
				"description": "Titanium and related SDKs used in application development",
				"name": "Client"
			}
		},
		"fixVersions": [],
		"resolution": {
			"id": "7",
			"description": "",
			"name": "Invalid"
		},
		"resolutiondate": "2019-04-12T20:41:50.000+0000",
		"created": "2019-01-16T11:04:12.000+0000",
		"priority": {
			"name": "None",
			"id": "6"
		},
		"labels": [],
		"versions": [
			{
				"id": "20238",
				"description": "",
				"name": "Release 7.5.0",
				"archived": false,
				"released": true,
				"releaseDate": "2018-11-15"
			}
		],
		"issuelinks": [],
		"assignee": null,
		"updated": "2019-04-12T20:41:50.000+0000",
		"status": {
			"description": "The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.",
			"name": "Closed",
			"id": "6",
			"statusCategory": {
				"id": 3,
				"key": "done",
				"colorName": "green",
				"name": "Done"
			}
		},
		"components": [
			{
				"id": "10202",
				"name": "Android",
				"description": "Android Platform"
			}
		],
		"description": "For a device configuration application, which uses a WiFi access point on the hardware to be configured, we're having a problem with some Android devices that appear to use the 3G network instead of the WiFi network to connect via a TCP socket to a local IP address (e.g. 192.168.1.1).\r\n\r\nIn the device, in question, the WiFi network is marked with an active connection but without internet connectivity.\r\nWe would need to understand if it is a problem that depends on the device or the SDK Titanium, and if it is possible to declare what type of connectivity to use to open the TCP client connection (Titanium.Network.Socket.TCP)\r\n\r\n{code}\r\nvar socket = Ti.Network.Socket.createTCP({\r\n    host: \"192.168.1.1\",\r\n    port: 7000,\r\n    timeout: 1000,\r\n    connected: function (e)\r\n    {\r\n    \tconsole.log(\"Socket OPEN\");\r\n    },\r\n\terror: function (e)\r\n\t{\r\n\t\tconsole.error(e.error);\r\n    }\r\n});\r\n{code}\r\n\r\nThe problem seems to be derived from the fact that if the device is connected to a wifi network without internet, the TCP socket connections tremble the SDK are opened through the 3G network (or are not opened) instead of via the WiFi network even if you try to connect to a local IP (eg 192.168.1.1).\r\n\r\n\r\nTo try to reproduce the problem the procedure should be as follows:\r\n\r\n1. I connect to a wifi network without internet with a server socket listening to the 192.168.1.1 address. The device must also be connected to a mobile network.\r\n\r\n2. Through the app I try to open the socket as indicated in the sample code\r\n\r\n\r\n\r\nThe cases we have detected are the following:\r\n\r\n- in some devices, the connection to the local IP on the wifi network without internet is without problems even if you are connected to the mobile network at the same time\r\n\r\n- in other devices, the connection to the local IP of the network without internet fails when the device is also on the mobile network\r\n\r\n- on the same device that presents problems, disabling the mobile data network on the device the connection to the local IP on the network without internet seems to work correctly\r\n\r\nOne of the devices that present the problem is the following:\r\n\r\nBlackview BV9500 (Android 8.1)\r\n\r\n",
		"attachment": [],
		"flagged": false,
		"summary": "WiFi network connection issue via a TCP socket to a local IP address (e.g. 192.168.1.1).",
		"creator": {
			"name": "morahman",
			"key": "morahman",
			"displayName": "Motiur Rahman",
			"active": true,
			"timeZone": "Asia/Dhaka"
		},
		"subtasks": [],
		"reporter": {
			"name": "morahman",
			"key": "morahman",
			"displayName": "Motiur Rahman",
			"active": true,
			"timeZone": "Asia/Dhaka"
		},
		"environment": null,
		"comment": {
			"comments": [
				{
					"id": "445408",
					"author": {
						"name": "jquick",
						"key": "jquick",
						"displayName": "Joshua Quick",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"body": "First, let's pretend we're talking about a computer/PC that has 2 network cards. One network card is connected to wired Ethernet. The other network card is connected to WIFI. In this scenario, each network card is expected to connect to different \"subnets\". In your case, your local WIFI has a subnet of \"192.168.x.x\". For your wired Ethernet card, ideally it should connect to a different subnet. If your wired Ethernet was connected to a different network with the same \"192.168.x.x\" subnet, then your PC may never use it because it sees that both network cards are connected to the same subnet and may choose one over the other.\r\n\r\nI think you are running into a similar scenario here. Perhaps some of your phones will use its 3G network as a 192.168.x.x subnet as well, kind of like how a hotspot works.\r\n\r\nTry changing your local WIFI access point to use a different subnet to prove that this is case.",
					"updateAuthor": {
						"name": "jquick",
						"key": "jquick",
						"displayName": "Joshua Quick",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"created": "2019-01-16T19:26:34.000+0000",
					"updated": "2019-01-16T19:26:34.000+0000"
				},
				{
					"id": "445430",
					"author": {
						"name": "sandrolain",
						"key": "sandrolain",
						"displayName": "Sandro Lain",
						"active": true,
						"timeZone": "Europe/Rome"
					},
					"body": "Hello\r\nI asked for assistance with this problem, and I think the issue has been opened somewhat out of context.\r\nThe problem comes with an app I'm developing for the configuration of an IoT device (gate open board) through connection to the WiFi access point of the IoT board.\r\nI can not change the network settings on the board.\r\nHow can I check if the mobile network uses the same subnet?",
					"updateAuthor": {
						"name": "sandrolain",
						"key": "sandrolain",
						"displayName": "Sandro Lain",
						"active": true,
						"timeZone": "Europe/Rome"
					},
					"created": "2019-01-17T08:02:34.000+0000",
					"updated": "2019-01-17T08:03:18.000+0000"
				},
				{
					"id": "445446",
					"author": {
						"name": "jquick",
						"key": "jquick",
						"displayName": "Joshua Quick",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"body": "There are free apps you can download from Google Play that'll display info about every network the device is connected to. Perhaps you might find info under your device's \"Network & Internet\" settings screen too?\r\n\r\nThe reason why I think you have subnet collision is because you said the device will correctly connect to IoT device when disabling the mobile network.\r\n\r\nWhen opening a socket in native code, you really only set the IP address and port number. The operating system will then select which network device to connect to, and that's based on the IP address' subnet mask.\r\n\r\nI haven't tried this before, but perhaps you should try connecting to your IoT device by mac address instead of by IP address?",
					"updateAuthor": {
						"name": "jquick",
						"key": "jquick",
						"displayName": "Joshua Quick",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"created": "2019-01-17T19:38:57.000+0000",
					"updated": "2019-01-17T19:38:57.000+0000"
				},
				{
					"id": "445447",
					"author": {
						"name": "jquick",
						"key": "jquick",
						"displayName": "Joshua Quick",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"body": "Also check if your device has hotspot or tethering enabled.",
					"updateAuthor": {
						"name": "jquick",
						"key": "jquick",
						"displayName": "Joshua Quick",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"created": "2019-01-17T19:39:50.000+0000",
					"updated": "2019-01-17T19:39:50.000+0000"
				},
				{
					"id": "445512",
					"author": {
						"name": "sandrolain",
						"key": "sandrolain",
						"displayName": "Sandro Lain",
						"active": true,
						"timeZone": "Europe/Rome"
					},
					"body": "Hello\r\nAs for the connection via mac-address is not possible because we can not know the mac-address of the device before, while the ip is static.\r\nThe devices on which there were problems are of our customer, I arrange to run tests with network analysis app that I selected in recent days so as to get more details.",
					"updateAuthor": {
						"name": "sandrolain",
						"key": "sandrolain",
						"displayName": "Sandro Lain",
						"active": true,
						"timeZone": "Europe/Rome"
					},
					"created": "2019-01-21T12:29:40.000+0000",
					"updated": "2019-01-21T12:29:40.000+0000"
				}
			],
			"maxResults": 8,
			"total": 8,
			"startAt": 0
		}
	}
}