{
	"id": "101671",
	"key": "TIMOB-11946",
	"fields": {
		"issuetype": {
			"id": "2",
			"description": "A new feature of the product, which has yet to be developed.",
			"name": "New Feature",
			"subtask": false
		},
		"project": {
			"id": "10153",
			"key": "TIMOB",
			"name": "Titanium SDK/CLI",
			"projectCategory": {
				"id": "10100",
				"description": "Titanium and related SDKs used in application development",
				"name": "Client"
			}
		},
		"fixVersions": [],
		"resolution": null,
		"resolutiondate": null,
		"created": "2012-09-21T09:39:26.000+0000",
		"priority": {
			"name": "Low",
			"id": "4"
		},
		"labels": [],
		"versions": [],
		"issuelinks": [],
		"assignee": null,
		"updated": "2018-02-28T20:03:15.000+0000",
		"status": {
			"description": "The issue is open and ready for the assignee to start work on it.",
			"name": "Open",
			"id": "1",
			"statusCategory": {
				"id": 2,
				"key": "new",
				"colorName": "blue-gray",
				"name": "To Do"
			}
		},
		"components": [
			{
				"id": "10206",
				"name": "iOS",
				"description": "iOS Platform"
			}
		],
		"description": "Titanium uses the MGSplitView as the library to control the SplitWindow generation. But only the most simple features are exposed. As the library is already loaded, I think we could proxy the more advanced features of this library, allowing more advanced UI's to be created using SplitWindow.\r\n\r\nSome of those features are (taken from MGSplitView docs on Github):\r\n\r\n* Allows toggling the visibility of the master view in either interface-orientation; i.e. you can have master-detail or detail-only in either landscape and/or portrait orientations (independently, and/or interactively).\r\n* Allows choosing whether the split orientation is vertical (i.e. left/right, like UISplitViewController), or horizontal (master above, and detail below). You can toggle between modes interactively, with animation.\r\n* Allows choosing whether the master view is before (above, or to left of) the detail view, or after it (below, or to the right).\r\n* Allows you to choose (and change) the position of the split, i.e. the relative sizes of the master and detail views.\r\n* Allows you to enable dragging of the split/divider between the master and detail views, with optional constraining via a delegate method.\r\n* Allows you to choose the width of the split between the master and detail views.\r\n* Preset \"divider styles\": one for non-draggable UISplitViewController-like dividers, and one for draggable, thicker style with a grip-strip.\r\n* Allows you to substitute your own divider-view (an MGSplitDividerView subclass), used to draw the split between the master and detail views.\r\n\r\nAlso it would be nice to update the library, specially for iOS6 as many bugs were fixed and performance enhancements were made.",
		"attachment": [],
		"flagged": false,
		"summary": "iOS: As Titanium uses MGSplitView for iPad SplitWindow, expose all the library features for more UI possibilities on iPad",
		"creator": {
			"name": "ygbr",
			"key": "ygbr",
			"displayName": "Ygor Lemos",
			"active": true,
			"timeZone": "America/Sao_Paulo"
		},
		"subtasks": [],
		"reporter": {
			"name": "ygbr",
			"key": "ygbr",
			"displayName": "Ygor Lemos",
			"active": true,
			"timeZone": "America/Sao_Paulo"
		},
		"environment": "ipad",
		"comment": {
			"comments": [],
			"maxResults": 0,
			"total": 0,
			"startAt": 0
		}
	}
}