{
	"id": "134863",
	"key": "AC-1666",
	"fields": {
		"issuetype": {
			"id": "1",
			"description": "A problem which impairs or prevents the functions of the product.",
			"name": "Bug",
			"subtask": false
		},
		"project": {
			"id": "12217",
			"key": "AC",
			"name": "Appcelerator - INBOX",
			"projectCategory": {
				"id": "10000",
				"description": "",
				"name": "Customer Service"
			}
		},
		"resolution": {
			"id": "8",
			"description": "",
			"name": "Needs more info"
		},
		"resolutiondate": "2014-10-28T08:01:26.000+0000",
		"created": "2014-08-18T13:01:56.000+0000",
		"labels": [
			"TCSupportTriage"
		],
		"versions": [],
		"issuelinks": [],
		"assignee": {
			"name": "mpmiranda",
			"key": "mpmiranda",
			"displayName": "Mauro Parra-Miranda",
			"active": true,
			"timeZone": "America/Mexico_City"
		},
		"updated": "2016-03-08T07:38:09.000+0000",
		"status": {
			"description": "The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.",
			"name": "Closed",
			"id": "6",
			"statusCategory": {
				"id": 3,
				"key": "done",
				"colorName": "green",
				"name": "Done"
			}
		},
		"components": [
			{
				"id": "14544",
				"name": "Alloy",
				"description": "Please enter tickets related to the Alloy here."
			},
			{
				"id": "14548",
				"name": "Titanium SDK & CLI",
				"description": "Please enter tickets related to the MobileSDK here."
			}
		],
		"description": "Confronting all users migrating from earlier versions of Ti with a suddenly appearing ActionBar is totally unacceptable.\r\n\r\nFor backward compatibility for migrating users showing the ActionBar must be off!\r\nHow on earth can you expect developers to invest a low of their own money into trying to fix issues that they didn't ask for! My customer is not willing to pay me for this work and off course he is right.\r\n\r\nI had to move to Ti 3.3.0 because of a new release of the iOS version of my app. Because of this I had to update my Macs to OSX Mavericks, cutting off the 3.1.3 path.\r\n\r\nI had already become very reluctant for updating my Ti tools because every time I do this I end up with a lot of work. This because you guys do not keep in mind that there are hard-working developers out there that simply have to update their apps without getting into a lot of migrating issues. Until now it has cost me 3 days, without getting anywhere. Or can I send the bill to Appcelerator?\r\n\r\nThis specific app must run from 2.3.5 upward.\r\n\r\nActionbar.hide() is not a professional solution. Adding a theme does not work for my app, and yes, I followed all the guidelines strictly! Even using the Tiapp.xml from a newly generated project having a theme without ActionBar does not help for this specific project.\r\n\r\nWhat could be hidden under the surface that prevents the ActionBar not hiding?\r\n",
		"attachment": [],
		"flagged": false,
		"summary": "ActionBar not able to hide - default must be hidden!",
		"creator": {
			"name": "ray@raymondverbruggen.nl",
			"key": "ray@raymondverbruggen.nl",
			"displayName": "Raymond Verbruggen",
			"active": true,
			"timeZone": "Europe/Berlin"
		},
		"subtasks": [],
		"reporter": {
			"name": "ray@raymondverbruggen.nl",
			"key": "ray@raymondverbruggen.nl",
			"displayName": "Raymond Verbruggen",
			"active": true,
			"timeZone": "Europe/Berlin"
		},
		"environment": "Mac OSX Mavericks, Ti 3.3.0, Samsung Galaxy S3",
		"comment": {
			"comments": [
				{
					"id": "319126",
					"author": {
						"name": "ray@raymondverbruggen.nl",
						"key": "ray@raymondverbruggen.nl",
						"displayName": "Raymond Verbruggen",
						"active": true,
						"timeZone": "Europe/Berlin"
					},
					"body": "UPDATE\r\n\r\nI found what caused the problem.\r\nMy app is multi platform eg. iOS and Android (that's why I use Ti). My windows are all similar in design. When I goto the next window I open it having opacity=0, the \"onOpen\" event animates the opacity from 0 to 1 in 250ms. This results in a smooth fading-in of the new window over the old one; a common behaviour both in iOS and Android.\r\n\r\nThe effect what I notice now is a kind of zoom-in effect.\r\n\r\nI do not want themes, I will take care of that myself.\r\n\r\nYou should pay much more attention to the basic grounds of Titanium and that is creating multi platform applications!!\r\n\r\nHow can I get rid of Android themes? I want my clean app back!!\r\n",
					"updateAuthor": {
						"name": "ray@raymondverbruggen.nl",
						"key": "ray@raymondverbruggen.nl",
						"displayName": "Raymond Verbruggen",
						"active": true,
						"timeZone": "Europe/Berlin"
					},
					"created": "2014-08-18T18:03:58.000+0000",
					"updated": "2014-08-18T18:03:58.000+0000"
				},
				{
					"id": "319180",
					"author": {
						"name": "mpmiranda",
						"key": "mpmiranda",
						"displayName": "Mauro Parra-Miranda",
						"active": true,
						"timeZone": "America/Mexico_City"
					},
					"body": "Hello! \r\n\r\nThis looks more like a question for the Q&A than a bug report. For the ActionBar to hide, you can follow the instructions here: \r\n\r\nhttp://www.appcelerator.com/blog/2014/08/hiding-the-android-actionbar/\r\n\r\nI understand your concerns on regards the migration of a version from an old version of Ti Mobile to a newer one; we have a product that is quickly evolving, therefore some breaking might occur with respect to the old API. \r\n\r\nPlease read this guide:\r\n\r\nhttp://docs.appcelerator.com/titanium/3.0/#!/guide/Android_Themes-section-34636181_AndroidThemes-OverridinganActivity%27sTheme\r\n\r\nin order to override the android themes. \r\n\r\nBest Regards!",
					"updateAuthor": {
						"name": "mpmiranda",
						"key": "mpmiranda",
						"displayName": "Mauro Parra-Miranda",
						"active": true,
						"timeZone": "America/Mexico_City"
					},
					"created": "2014-08-18T23:39:26.000+0000",
					"updated": "2014-08-18T23:39:26.000+0000"
				},
				{
					"id": "319245",
					"author": {
						"name": "ray@raymondverbruggen.nl",
						"key": "ray@raymondverbruggen.nl",
						"displayName": "Raymond Verbruggen",
						"active": true,
						"timeZone": "Europe/Berlin"
					},
					"body": "This is a real bug. \r\n\r\nWhen going from version 3.1.3 to 3.3.0 my app does not work as it previously did.\r\n1) Suddenly some bar appears (first instance I didn't even know what that bar was called).\r\n2) After finding out that this was called an ActionBar the proposed ways of hiding it where not working\r\n3) After two days of try and error I found that it was caused by using \"opacity\" on the windows, that was not documented\r\n\r\nIn iOS there are no ActionBars, so where is \"multi platform\" gone?\r\nHaving the ability of using ActionBars, Themes, etc might be nice for new developments, but default this must be set OFF because it was not present in older Android versions, and you should not confront hard working developers with stuff like this:\r\n- which they did not program\r\n- cannot remove because of some hidden and not-documented effects\r\n- simply publishing a new version of an already existing app is very time consuming\r\n- are not paid for by their customers because its not their problem\r\n\r\nThis is not the first time that a lot of behaviours change when migrating to new Ti versions.\r\nFor example the following are fine on iOS on Ti 3.3.0 and Android on Ti 3.1.3 and have been broken on Android on Ti 3.3.0:\r\n- ActionBar displaying suddenly\r\n- opacity on windows cannot be used anymore\r\n- my app is now crashing after a startup animation, cannot find why yet, but I have to make a release!\r\n- listviews are displayed very differently now, there are no lines between the rows anymore\r\n- textfields look very different now\r\n\r\nIf you migrate to a new version of Ti mobile then you absolutely must take care that migrating apps behave as close as possible to the old situation and where it does not, provide guidelines what will happen and how to solve that!!!\r\n\r\nSo how am I going to fix the above issues?\r\n\r\nBest regards,\r\nRaymond\r\n",
					"updateAuthor": {
						"name": "ray@raymondverbruggen.nl",
						"key": "ray@raymondverbruggen.nl",
						"displayName": "Raymond Verbruggen",
						"active": true,
						"timeZone": "Europe/Berlin"
					},
					"created": "2014-08-19T07:35:33.000+0000",
					"updated": "2014-08-19T07:35:33.000+0000"
				},
				{
					"id": "319354",
					"author": {
						"name": "mpmiranda",
						"key": "mpmiranda",
						"displayName": "Mauro Parra-Miranda",
						"active": true,
						"timeZone": "America/Mexico_City"
					},
					"body": "Hello Raymond! \r\n\r\nThanks for your desire to improve the platform. Please create a bug report for each of your issues. In order to create effective bugs, so we can transfer those to the right project, follow this guide:\r\n\r\nhttps://wiki.appcelerator.org/display/guides2/Reporting+Bugs+or+Requesting+Features#ReportingBugsorRequestingFeatures-BugSubmissionSteps\r\n\r\nIn short:\r\n\r\n1. Find possible bug\r\n2. Search Jira in the relevant project thoroughly for similar issues\r\n3. Once certain of a bug:\r\n-Create a Jira ticket (one ticket per bug)\r\n-Keep it as concise and as factual as possible\r\n-Include your testcase (in the form of app.js with classic titanium, so you can just create a new mobile project and paste the code into app.js)\r\nWatch ticket, to show your support for the ticket's resolution\r\n\r\nI recommend that we close this one, and we focus in creating individual bugs on this. \r\n\r\nBest Regards!",
					"updateAuthor": {
						"name": "mpmiranda",
						"key": "mpmiranda",
						"displayName": "Mauro Parra-Miranda",
						"active": true,
						"timeZone": "America/Mexico_City"
					},
					"created": "2014-08-19T21:44:44.000+0000",
					"updated": "2014-08-19T21:44:44.000+0000"
				}
			],
			"maxResults": 4,
			"total": 4,
			"startAt": 0
		}
	}
}