{
	"id": "80575",
	"key": "TIMOB-5354",
	"fields": {
		"issuetype": {
			"id": "1",
			"description": "A problem which impairs or prevents the functions of the product.",
			"name": "Bug",
			"subtask": false
		},
		"project": {
			"id": "10153",
			"key": "TIMOB",
			"name": "Titanium SDK/CLI",
			"projectCategory": {
				"id": "10100",
				"description": "Titanium and related SDKs used in application development",
				"name": "Client"
			}
		},
		"fixVersions": [
			{
				"id": "14162",
				"description": "Release 3.1.0",
				"name": "Release 3.1.0",
				"archived": true,
				"released": true,
				"releaseDate": "2013-04-16"
			},
			{
				"id": "14700",
				"description": "2012 Sprint 25",
				"name": "2012 Sprint 25",
				"archived": true,
				"released": true,
				"releaseDate": "2012-12-17"
			},
			{
				"id": "14699",
				"description": "2012 Sprint 25 Core",
				"name": "2012 Sprint 25 Core",
				"archived": true,
				"released": true,
				"releaseDate": "2012-12-17"
			}
		],
		"resolution": {
			"id": "1",
			"description": "A fix for this issue is checked into the tree and tested.",
			"name": "Fixed"
		},
		"resolutiondate": "2012-12-13T17:56:49.000+0000",
		"created": "2011-09-23T12:03:12.000+0000",
		"priority": {
			"name": "High",
			"id": "2"
		},
		"labels": [
			"core",
			"module_textarea",
			"qe-testadded"
		],
		"versions": [
			{
				"id": "13271",
				"description": "Release 2.1.0",
				"name": "Release 2.1.0",
				"archived": false,
				"released": true,
				"releaseDate": "2012-06-29"
			}
		],
		"issuelinks": [
			{
				"id": "23441",
				"type": {
					"id": "10003",
					"name": "Relates",
					"inward": "relates to",
					"outward": "relates to"
				},
				"outwardIssue": {
					"id": "98396",
					"key": "TIMOB-10318",
					"fields": {
						"summary": "iOS: animation redraw problem",
						"status": {
							"description": "The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.",
							"name": "Closed",
							"id": "6",
							"statusCategory": {
								"id": 3,
								"key": "done",
								"colorName": "green",
								"name": "Done"
							}
						},
						"priority": {
							"name": "High",
							"id": "2"
						},
						"issuetype": {
							"id": "1",
							"description": "A problem which impairs or prevents the functions of the product.",
							"name": "Bug",
							"subtask": false
						}
					}
				}
			}
		],
		"assignee": {
			"name": "ssekhri",
			"key": "ssekhri",
			"displayName": "Satyam Sekhri",
			"active": true,
			"timeZone": "America/Los_Angeles"
		},
		"updated": "2013-01-03T11:01:23.000+0000",
		"status": {
			"description": "The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.",
			"name": "Closed",
			"id": "6",
			"statusCategory": {
				"id": 3,
				"key": "done",
				"colorName": "green",
				"name": "Done"
			}
		},
		"components": [
			{
				"id": "10206",
				"name": "iOS",
				"description": "iOS Platform"
			}
		],
		"description": "The case here is that the text area is being animated, to adjust for the keyboard when TextArea is focused so that the user sees the bottom of the text area when he tries to edit the textarea. This looks good when animating the bottom up but looks weird when the user clicks 'return' on the keyboard and then the bottom of textarea comes down. It looks like the animation starts at a too high value for bottom.\r\n\r\nSample app.js:\r\n{noformat}\r\nvar win = Titanium.UI.createWindow({backgroundColor: 'white'});\r\n\r\nvar ta1 = Ti.UI.createTextArea({\r\n\t\tvalue: 'Next level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably havent heard of them mixtape. High life letterpress shoreditch fap, mcsweeneys lomo master cleanse marfa vice wayfarers keffiyeh before they sold out dreamcatcher blog. Freegan you probably havent heard of them wolf, skateboard thundercats gentrify letterpress food truck portland mcsweeneys jean shorts photo booth shoreditch tumblr. Readymade food truck fixie, quinoa photo booth iphone blog etsy artisan level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably haven level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably havent heard of them mixtape. High life letterpress shoreditch fap, mcsweeneys lomo master cleanse marfa vice wayfarers keffiyeh before they sold out dreamcatcher blog. Freegan you probably havent heard of them wolf, skateboard thundercats gentrify letterpress food truck portland mcsweeneys jean shorts photo booth shoreditch tumblr. Readymade food truck fixie, quinoa photo booth iphone blog etsy artisan level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably haven level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably havent heard of them mixtape. High life letterpress shoreditch fap, mcsweeneys lomo master cleanse marfa vice wayfarers keffiyeh before they sold out dreamcatcher blog. Freegan you probably havent heard of them wolf, skateboard thundercats gentrify letterpress food truck portland mcsweeneys jean shorts photo booth shoreditch tumblr. Readymade food truck fixie, quinoa photo booth iphone blog etsy artisan level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably haven level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably havent heard of them mixtape. High life letterpress shoreditch fap, mcsweeneys lomo master cleanse marfa vice wayfarers keffiyeh before they sold out dreamcatcher blog. Freegan you probably havent heard of them wolf, skateboard thundercats gentrify letterpress food truck portland mcsweeneys jean shorts photo booth shoreditch tumblr. Readymade food truck fixie, quinoa photo booth iphone blog etsy artisan level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably haven level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably havent heard of them mixtape. High life letterpress shoreditch fap, mcsweeneys lomo master cleanse marfa vice wayfarers keffiyeh before they sold out dreamcatcher blog. Freegan you probably havent heard of them wolf, skateboard thundercats gentrify letterpress food truck portland mcsweeneys jean shorts photo booth shoreditch tumblr. Readymade food truck fixie, quinoa photo booth iphone blog etsy artisan level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably haven level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably havent heard of them mixtape. High life letterpress shoreditch fap, mcsweeneys lomo master cleanse marfa vice wayfarers keffiyeh before they sold out dreamcatcher blog. Freegan you probably havent heard of them wolf, skateboard thundercats gentrify letterpress food truck portland mcsweeneys jean shorts photo booth shoreditch tumblr. Readymade food truck fixie, quinoa photo booth iphone blog etsy artisan level lo-fi messenger bag, cosby sweater blog readymade iphone cardigan farm-to-table stumptown vice mlkshk. Leggings marfa vegan, wayfarers williamsburg mixtape before they sold out whatever Austin gentrify pitchfork iphone trust fund. Cosby sweater Austin messenger bag, squid american apparel fixie brunch beard blog scenester keytar. Gentrify vinyl you probably haven',\r\n\t\tbackgroundColor: '#fce',\r\n\t\ttop: 0,\r\n\t\tleft: 0,\r\n\t\tright: 0,\r\n\t\tbottom: 0,\r\n\t\tcolor: 'green',\r\n\t\tfont: {fontSize : 15},\r\n\t\tautoLink: Ti.UI.AUTODETECT_ALL\r\n\t});\r\n\r\nta1.addEventListener('focus', function(){\r\n  var anim = Ti.UI.createAnimation({\r\n\t\tduration: 1500,\r\n\t\tbottom: 220\r\n\t});\r\n\t// Set the value to itself to force set position to end\r\n\tta1.value = ta1.value;\r\n\tta1.animate(anim);\r\n});\r\n\r\nta1.addEventListener('blur', function(){\r\n\tvar anim = Ti.UI.createAnimation({\r\n\t\tduration: 1500,\r\n\t\tbottom: 0\r\n\t});\r\n\tta1.animate(anim);\r\n});\r\n\r\nwin.add(ta1);\r\nwin.open()\r\n{noformat}\r\n\r\nIt can be noticed that 11 lines of text is seen on focus but when the 'return' is hit, animation starts as if the textarea is higher than intended (5-6 lines are seen at the start of the animation)",
		"attachment": [],
		"flagged": false,
		"summary": "iOS: Text area animation buggy",
		"creator": {
			"name": "sbhimavarapu",
			"key": "sbhimavarapu",
			"displayName": "Sandeep Bhimavarapu",
			"active": true,
			"timeZone": "America/Los_Angeles"
		},
		"subtasks": [
			{
				"id": "106862",
				"key": "TIMOB-12136",
				"fields": {
					"summary": "Backport: TIMOB-5354",
					"status": {
						"description": "The issue is considered finished, the resolution is correct. Issues which are closed can be reopened.",
						"name": "Closed",
						"id": "6",
						"statusCategory": {
							"id": 3,
							"key": "done",
							"colorName": "green",
							"name": "Done"
						}
					},
					"priority": {
						"name": "High",
						"id": "2"
					},
					"issuetype": {
						"id": "5",
						"description": "The sub-task of the issue",
						"name": "Sub-task",
						"subtask": true
					}
				}
			}
		],
		"reporter": {
			"name": "sbhimavarapu",
			"key": "sbhimavarapu",
			"displayName": "Sandeep Bhimavarapu",
			"active": true,
			"timeZone": "America/Los_Angeles"
		},
		"environment": "Product: Mobile\r\nTitanium SDK: Mobile 1.7.2\r\nPlatform OS: iOS\r\nPlatform OS Version: 4.3.5",
		"closedSprints": [
			{
				"id": 3,
				"state": "closed",
				"name": "Release 3.0.0",
				"startDate": "2012-09-27T05:26:46.636Z",
				"endDate": "2012-10-08T20:05:00.000Z",
				"completeDate": "2012-12-20T17:03:19.403Z"
			}
		],
		"comment": {
			"comments": [
				{
					"id": "203022",
					"author": {
						"name": "jyounus",
						"key": "jyounus",
						"displayName": "Junaid Younus",
						"active": true,
						"timeZone": "Europe/London"
					},
					"body": "Tested on the iOS simulator with 2.1GA, issue still exists.",
					"updateAuthor": {
						"name": "jyounus",
						"key": "jyounus",
						"displayName": "Junaid Younus",
						"active": true,
						"timeZone": "Europe/London"
					},
					"created": "2012-07-12T14:02:15.000+0000",
					"updated": "2012-07-12T14:02:15.000+0000"
				},
				{
					"id": "230594",
					"author": {
						"name": "mstepanov",
						"key": "mstepanov",
						"displayName": "Max Stepanov",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"body": "Used to work in 3.0.0 master builds and then regressed by https://github.com/appcelerator/titanium_mobile/pull/2763\nFix is to have UIViewAnimationOptionBeginFromCurrentState in animation options.",
					"updateAuthor": {
						"name": "mstepanov",
						"key": "mstepanov",
						"displayName": "Max Stepanov",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"created": "2012-12-10T08:05:06.000+0000",
					"updated": "2012-12-10T08:05:06.000+0000"
				},
				{
					"id": "230784",
					"author": {
						"name": "mstepanov",
						"key": "mstepanov",
						"displayName": "Max Stepanov",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"body": "PR https://github.com/appcelerator/titanium_mobile/pull/3568",
					"updateAuthor": {
						"name": "mstepanov",
						"key": "mstepanov",
						"displayName": "Max Stepanov",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"created": "2012-12-11T01:52:29.000+0000",
					"updated": "2012-12-11T01:52:29.000+0000"
				},
				{
					"id": "232951",
					"author": {
						"name": "ssekhri",
						"key": "ssekhri",
						"displayName": "Satyam Sekhri",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"body": "On click of Return on keyboard, the text area animates down smoothly and also there is no gap between the last line of text and text area bottom border\r\nVerified on:\r\nTitanium Studio: 3.0.1.201212181159\r\nTitanium SDK: 3.1.0.v20130102102603\r\niOS Device: iPhone 3GS (v5.1), iPad2 (v5.1)\r\nXCode: 4.5.2 ",
					"updateAuthor": {
						"name": "ssekhri",
						"key": "ssekhri",
						"displayName": "Satyam Sekhri",
						"active": true,
						"timeZone": "America/Los_Angeles"
					},
					"created": "2013-01-03T10:25:43.000+0000",
					"updated": "2013-01-03T10:25:43.000+0000"
				}
			],
			"maxResults": 6,
			"total": 6,
			"startAt": 0
		}
	}
}