{
	"id": "82316",
	"key": "TIMOB-6900",
	"fields": {
		"issuetype": {
			"id": "2",
			"description": "A new feature of the product, which has yet to be developed.",
			"name": "New Feature",
			"subtask": false
		},
		"project": {
			"id": "10153",
			"key": "TIMOB",
			"name": "Titanium SDK/CLI",
			"projectCategory": {
				"id": "10100",
				"description": "Titanium and related SDKs used in application development",
				"name": "Client"
			}
		},
		"fixVersions": [],
		"resolution": null,
		"resolutiondate": null,
		"created": "2011-11-04T02:50:33.000+0000",
		"priority": {
			"name": "Low",
			"id": "4"
		},
		"labels": [],
		"versions": [],
		"issuelinks": [],
		"assignee": {
			"name": "ingo",
			"key": "ingo",
			"displayName": "Ingo Muschenetz",
			"active": true,
			"timeZone": "America/Los_Angeles"
		},
		"updated": "2014-06-18T22:52:41.000+0000",
		"status": {
			"description": "The issue is open and ready for the assignee to start work on it.",
			"name": "Open",
			"id": "1",
			"statusCategory": {
				"id": 2,
				"key": "new",
				"colorName": "blue-gray",
				"name": "To Do"
			}
		},
		"components": [
			{
				"id": "10224",
				"name": "TiAPI",
				"description": "This component is used for cross-platform API work. Specifications are most likely to use this component."
			}
		],
		"description": "h2. Problem\r\n\r\nWith some Android markets, there is a problem related to the folder that Titanium application will create on the SD card (which is named after the application id/ package name) for use from within the application. These markets would download the application via it's own application and would save the apk on the SD card, unfortunately saving it under the package name. This of course leads to the problem that the application could not create it's own folder (because a file of the same name existed) and the application would crash when trying to access files that normally would have been in that folder.\r\n\r\nNow, I do believe that the behavior of that market application was less then optimal (they have by now released a fixed version, but that is useless for us, because we have no influence on the market app version a user uses to download our application..), but as it is not clear how many other markets might have this issue.\r\n\r\nh2. Request / Solution\r\n\r\nTo have a means of providing an alternative solution from application side, it would be really great if the name of the automatically created folder could be modified.\r\n\r\nh2. Justification\r\n\r\nWithout this, Titanium apps may not be submitted to some Android marketplaces.",
		"attachment": [],
		"flagged": false,
		"summary": "API: Android - allow customization of application folder name on SD card",
		"creator": {
			"name": "kaholli",
			"key": "kaholli",
			"displayName": "Kathrin Holweger",
			"active": true,
			"timeZone": "America/Los_Angeles"
		},
		"subtasks": [],
		"reporter": {
			"name": "kaholli",
			"key": "kaholli",
			"displayName": "Kathrin Holweger",
			"active": true,
			"timeZone": "America/Los_Angeles"
		},
		"environment": "* Android",
		"comment": {
			"comments": [],
			"maxResults": 0,
			"total": 0,
			"startAt": 0
		}
	}
}